#再帰版フィボナッチ
#変数の対応
#$0=0
#$1=引数&戻り値
#$2=一時変数
#$3=1
#$30=スタックポインタ
#$31=リンクレジスタ
#レジスタの退避はcallerが行う
	li $30 0xffff		# $30 = 0xffff
	li $3 1				# $3 = 1
	load $0 $1 N		# $1 = N
	jal FIB				# $1 = fib $1
	write $1			# $1を出力
	halt
FIB:
	cmp $1 $3 $2		# $2 = cmp($1, 1)
	jmp $2 0b100 RET	# if $1 <= 1 then goto RET
	addi $30 $30 -3		# $30 = $30 - 3
	store $30 $31 2		# [$30 + 2] = $31
	store $30 $1 1		# [$30 + 1] = $1
	addi $1 $1 -1		# $1 = $1 - 1
	jal FIB				# $1 = fib $1
	store $30 $1 0		# [$30 + 0] = $1
	load $30 $1 1		# $1 = [$30 + 1]
	addi $1 $1 -2		# $1 = $1 - 2
	jal FIB				# $1 = fib $1
	load $30 $2 0		# $2 = [$30 + 0]
	add $1 $2 $1		# $1 = $1 + $2
	load $30 $31 2		# $31 = [$30 + 2]
	addi $30 $30 3		# $30 = $30 + 3
RET:
	jr
N:	raw 10				# 定数N
